[
  {
    "nivel": "TRL 1 - Princípios Básicos Observados e Relatados",
    "perguntas": [
      "Os princípios físicos e elétricos fundamentais foram identificados e compreendidos?",
      "Existem experimentos ou estudos teóricos que validam os conceitos elétricos envolvidos? Foram realizados testes para validação dos conceitos fundamentais?",
      "As normas técnicas e regulamentações (ex: NBRs, NR-10, IEEE) foram levantadas? Foram consideradas as regulamentações legais, como a LGPD, para garantir conformidade?",
      "Foram analisados os riscos técnicos e operacionais relacionados à aplicação elétrica? Os riscos críticos relacionados à segurança foram identificados e documentados?",
      "A metodologia de pesquisa utilizada é adequada para levar o projeto a níveis superiores de maturidade tecnológica? A documentação da metodologia é essencial para garantir a validação da solução?"
    ]
  },
  {
    "nivel": "TRL 2 - Formulação do Conceito Tecnológico",
    "perguntas": [
      "Foram definidas aplicações potenciais do sistema elétrico proposto? A documentação das funcionalidades foi iniciada para viabilizar a produção em escala?",
      "Foram identificadas as principais funcionalidades elétricas esperadas?",
      "O conceito elétrico foi documentado com foco em viabilidade e segurança?",
      "Foram mapeadas limitações técnicas iniciais (GAPs) da proposta?",
      "Estudos preliminares confirmam a viabilidade de aplicação da solução elétrica?"
    ]
  },
  {
    "nivel": "TRL 3 - Prova de Conceito Experimental",
    "perguntas": [
      "O projeto conceitual do sistema elétrico foi realizado e documentado?",
      "Os requisitos de desempenho elétrico (tensão, corrente, potência) foram especificados?",
      "Foram realizados testes iniciais (protótipos ou simulações) para validação do conceito?",
      "Foram identificadas falhas ou limitações nos testes elétricos preliminares?",
      "A viabilidade científica e técnica do sistema elétrico foi comprovada?",
      "Técnicas de medição, proteção e controle foram exploradas para desenvolvimento futuro?"
    ]
  },
  {
    "nivel": "TRL 4 - Validação de Componentes em Ambiente Laboratorial",
    "perguntas": [
      "Os componentes elétricos foram testados individualmente em laboratório?",
      "Foram identificados e documentados os GAPs técnicos remanescentes?",
      "Foram definidos requisitos globais do sistema para integração com usuários ou outros sistemas?",
      "Métricas elétricas (ex: rendimento, fator de potência, perdas) foram estabelecidas?"
    ]
  },
  {
    "nivel": "TRL 5 - Validação do Sistema em Ambiente Relevante",
    "perguntas": [
      "Os requisitos elétricos foram adaptados ao ambiente realista de operação?",
      "Um projeto preliminar do sistema foi desenvolvido e validado por simulação ou ensaio?",
      "Foram analisadas falhas potenciais da instalação elétrica ou de componentes críticos?",
      "Interfaces de conexão elétrica e compatibilidades foram identificadas?",
      "A interação entre subsistemas elétricos (ex: geração, controle, proteção) foi analisada?",
      "Testes preliminares em ambiente simulado foram realizados com sucesso?"
    ]
  },
  {
    "nivel": "TRL 6 - Demonstração do Sistema em Ambiente Relevante",
    "perguntas": [
      "Funções críticas como proteção, aterramento e continuidade foram validadas?",
      "O ambiente elétrico de funcionamento (ex: rede, carga, painéis) foi definido e simulado?",
      "Requisitos de desempenho do sistema em operação foram documentados?",
      "Foi estabelecida a documentação técnica completa de sistema e subsistemas elétricos?",
      "A tecnologia demonstrou desempenho aceitável em ambiente relevante?",
      "Protótipo representativo foi testado com cargas reais ou equivalentes simuladas?"
    ]
  },
  {
    "nivel": "TRL 7 - Demonstração do Protótipo em Ambiente Realista",
    "perguntas": [
      "Requisitos de desempenho foram definidos considerando o ambiente real?",
      "Foram descritas as condições reais de operação e restrições elétricas (ex: flutuações de tensão)?",
      "Protocolos e procedimentos de ensaio elétrico foram documentados?",
      "Foram testadas interfaces elétricas sob condições normais e de falha?",
      "Simulações de operação do sistema elétrico em cenários reais foram realizadas?",
      "Protótipo foi conectado e testado em condições reais de operação?",
      "Resultados dos testes elétricos foram satisfatórios e registrados?",
      "Documentação técnica e de ensaios foi concluída?",
      "Aspectos de escalabilidade e custos foram analisados para a tecnologia elétrica?"
    ]
  },
  {
    "nivel": "TRL 8 - Certificação do Sistema Elétrico Completo",
    "perguntas": [
      "O modelo final foi montado e integrado ao sistema real?",
      "Componentes foram ajustados para compatibilidade elétrica com o sistema?",
      "O sistema foi testado e qualificado para a função elétrica pretendida?",
      "Certificações e regulamentações obrigatórias foram concluídas? Foram consideradas as regulamentações legais, como a LGPD, para garantir conformidade?",
      "Controle de configuração e manutenção do sistema elétrico foi documentado?"
    ]
  },
  {
    "nivel": "TRL 9 - Sistema Operacional e Produção em Escala",
    "perguntas": [
      "O sistema elétrico foi operado com sucesso em condições reais?",
      "A tecnologia elétrica foi implementada com êxito em sua aplicação final?",
      "Processos de fabricação, montagem e testes foram padronizados?",
      "Foram publicadas patentes, normas técnicas ou estudos sobre a aplicação elétrica? Foram realizados testes para validação dos conceitos fundamentais?",
      "A replicação do sistema é viável com os mesmos requisitos e qualidade?"
    ]
  }
]