[
    {
      "nivel": "TRL 1: Principios básicos observados e reportados",
      "perguntas": [
        "Foram identificadas leis (LGPD, Cybersegurança, legislação ambiental) e pressupostos utilizados na nova tecnologia e não impedem sua aplicação?",
        "Foi levantada e documentada a ideia dos riscos, custos e cronograma para desenvolvimento da pesquisa tecnológica?",
        "Foi identificado quem e onde será realizada as pesquisas da tecnologia? "
      ]
    },
    {
      "nivel": "TRL 2: Conceito tecnológico e/ou aplicação formulados",
      "perguntas": [
        "Foram formuladas as potenciais aplicações?",
        "Foi realizada pesquisa em ambiente de trabalho?",
        "Foram identificadas as principais funções a serem desempenhadas pela tecnologia?",
        "Foi documentada a viabilidade das aplicações confirmadas por estudos?",
        "Foi identificada a funcionalidade da tecnologia?",
        "Foram identificados possíveis GAPs da tecnologia e documentados?",
        "Sabe que programa (projeto) a tecnologia vai apoiar?"
      ]
    },
    {
      "nivel": "TRL 3: Tecnologia validada em ambiente de laboratório",
      "perguntas": [
        "Foi idealizado o projeto conceitual do elemento e documentado? ",
        "Foram especificados os requisitos de desempenho da tecnologia em ambiente operacional?",
        "Foi verificada a viabilidade da aplicação por experimentos de laboratório (simulação)? ",
        "Foram identificados os possíveis falhas da tecnologia em experimentos de laboratório? ",
        "Foram identificados e documentados os componentes que devem trabalhar juntos(visão sistêmica)? ",
        "Foram identificadas as tecnicas de desenvolvimento da tecnologia?"
      ]
    },
    {
      "nivel": "TRL 4: Tecnologia validada em ambiente relevante",
      "perguntas": [
        "Foi consolidado o projeto conceitual da tecnologia?",
        "Foram testados os componentes individuais em laboratórios e realizados relatórios?",
        "Foram totalmente identificados os possíveis GAP’s da tecnologia ?",
        "Foram identificados os requisitos gerais do sistema para aplicação aos usuários finais? ",
        "Foram estabelecidas as métricas de desempenho da tecnologia?",
        "Foram iniciados os estudos de integração da tecnologia ao projeto final?"
      ]
    },
    {
      "nivel": "TRL 5: Tecnologia testada em ambiente relevante",
      "perguntas": [
        "Foi realizado a definição preliminar de requisitos de desempenho no ambiente relevante?",
        "Foi realizado o  projeto preliminar do elemento, suportado por modelos apropriados para a verificação funções críticas?",
        "Foi realizado plano de teste de função crítica para análise dos efeitos de escala?",
        "Foram identificados os requisitos de interface de sistema?",
        "Foram identificadas as interações entre os componentes / subsistemas?",
        "Foi realizada modificações no ambiente de laboratório para aproximar ambiente operacional deixando apto a testes?",
        "Foram realizados testes tecnológicos dos componentes em ambiente relevante?"
      ]
    },
    {
      "nivel": "TRL 6: Sistema demonstrado em ambiente relevante",
      "perguntas": [
        "Foram realizados identificação e análise das funções críticas do elemento e verificadas as funções críticas e documentadas em relatório?",
        "Foram documentados os requisitos completos de sistema e subsistema para funcionamento?",
        "Foram concluídas as avaliações das características de desempenho da tecnologia mesmo com os possíveis GAP’s?",
        "Foi testado o modelo representativo (protótipo) completo em laboratório, ambiente operacional de alta fidelidade (simulação)?"
      ]
    },
    {
      "nivel": "TRL 7: Sistema operacional demonstrado em ambiente real",
      "perguntas": [
        "O sistema operacional foi demonstrado em ambiente real?",
        "O desempenho foi validado em condições reais?",
        "Os usuários aprovaram o funcionamento?"
      ]
    },
    {
      "nivel": "TRL 8: Sistema completo qualificado",
      "perguntas": [
        "O sistema completo está qualificado para uso?",
        "Todos os testes finais foram realizados e aprovados?",
        "As documentações finais estão completas?"
      ]
    },
    {
      "nivel": "TRL 9: Sistema comprovado em operações reais",
      "perguntas": [
        "O sistema foi comprovado em operações reais?",
        "Os usuários finais validaram o sistema?",
        "As condições operacionais finais foram atendidas?"
      ]
    }
  ]
  